app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    if params[:artist_id]
      begin
        Artist.find(params[:artist_id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    if params[:artist_id]
      begin
        Artist.find(params[:artist_id])
      rescue
        redirect_to artists_path, alert: "Artist not found"
      end
      begin
        @song = Song.find(params[:id])